<template>
  <div class="task-with-reward">
    <!-- 進度條 + 領取按鈕 -->
    <div class="progress-container">
      <div class="reward-icon red">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="42"
          height="51"
          viewBox="0 0 42 51"
          fill="none"
        >
          <path
            d="M36.1667 24.208H23.25V11.2913H36.1667M32.2917 39.708C31.264 39.708 30.2783 39.2997 29.5516 38.573C28.8249 37.8463 28.4167 36.8607 28.4167 35.833C28.4167 34.8053 28.8249 33.8197 29.5516 33.093C30.2783 32.3663 31.264 31.958 32.2917 31.958C33.3194 31.958 34.305 32.3663 35.0317 33.093C35.7584 33.8197 36.1667 34.8053 36.1667 35.833C36.1667 36.8607 35.7584 37.8463 35.0317 38.573C34.305 39.2997 33.3194 39.708 32.2917 39.708ZM18.0833 24.208H5.16667V11.2913H18.0833M9.04167 39.708C8.01395 39.708 7.02833 39.2997 6.30163 38.573C5.57492 37.8463 5.16667 36.8607 5.16667 35.833C5.16667 34.8053 5.57492 33.8197 6.30163 33.093C7.02833 32.3663 8.01395 31.958 9.04167 31.958C10.0694 31.958 11.055 32.3663 11.7817 33.093C12.5084 33.8197 12.9167 34.8053 12.9167 35.833C12.9167 36.8607 12.5084 37.8463 11.7817 38.573C11.055 39.2997 10.0694 39.708 9.04167 39.708ZM20.6667 0.958008C9.24833 0.958008 0 2.24967 0 11.2913V35.833C0 38.231 0.952602 40.5308 2.64824 42.2264C4.34388 43.9221 6.64367 44.8747 9.04167 44.8747L5.16667 48.7497V50.0413H36.1667V48.7497L32.2917 44.8747C34.6897 44.8747 36.9895 43.9221 38.6851 42.2264C40.3807 40.5308 41.3333 38.231 41.3333 35.833V11.2913C41.3333 2.24967 32.085 0.958008 20.6667 0.958008Z"
            fill="white"
          />
        </svg>
        <div class="task-title">{{ task.title }}</div>
      </div>
      <div class="progress-bar">
        <div class="location">位於{{ task.title }}定位</div>
        <progress :value="task.progress" max="100"></progress>
        <div class="progress-icon">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="23"
            height="23"
            viewBox="0 0 23 23"
            fill="none"
          >
            <path
              d="M17.25 2.13492C18.9982 3.11375 20.45 4.52162 21.4593 6.217C22.4686 7.91239 23 9.83557 23 11.7932C23 13.7509 22.4686 15.6741 21.4592 17.3694C20.4499 19.0648 18.9981 20.4727 17.2499 21.4515C15.5016 22.4303 13.5185 22.9456 11.4998 22.9455C9.48113 22.9455 7.49802 22.4302 5.74981 21.4513C4.0016 20.4724 2.54988 19.0645 1.54058 17.3691C0.531277 15.6737 -5.12781e-05 13.7505 3.7118e-09 11.7929L0.00575014 11.4315C0.0701537 9.50551 0.64808 7.62854 1.68319 5.9836C2.71829 4.33866 4.17525 2.98189 5.91203 2.04557C7.6488 1.10925 9.60612 0.625334 11.5932 0.640993C13.5802 0.656652 15.5291 1.17136 17.25 2.13492ZM11.5 5.10145C11.195 5.10145 10.9025 5.21895 10.6868 5.4281C10.4712 5.63725 10.35 5.92091 10.35 6.21669C9.435 6.21669 8.55748 6.56918 7.91048 7.19663C7.26348 7.82407 6.9 8.67506 6.9 9.5624C6.9 10.4497 7.26348 11.3007 7.91048 11.9282C8.55748 12.5556 9.435 12.9081 10.35 12.9081V15.1386C10.1593 15.1488 9.96887 15.1137 9.7953 15.0364C9.62174 14.959 9.47029 14.8418 9.3541 14.6947L9.2759 14.5821C9.11856 14.336 8.8687 14.1589 8.57916 14.0883C8.28961 14.0176 7.98309 14.0589 7.72439 14.2035C7.4657 14.3481 7.27512 14.5845 7.19295 14.8629C7.11078 15.1412 7.14347 15.4397 7.2841 15.6951C7.57762 16.1888 7.99631 16.6016 8.50046 16.8943C9.00461 17.1871 9.57751 17.3501 10.1648 17.3679H10.35C10.3498 17.6413 10.453 17.9052 10.6402 18.1096C10.8274 18.3139 11.0855 18.4445 11.3654 18.4765L11.5 18.4843C11.805 18.4843 12.0975 18.3668 12.3132 18.1577C12.5288 17.9485 12.65 17.6648 12.65 17.3691L12.8524 17.3635C13.7489 17.3132 14.59 16.9259 15.1967 16.2839C15.8035 15.6419 16.1282 14.7957 16.1018 13.9252C16.0755 13.0546 15.7002 12.2284 15.0556 11.622C14.411 11.0156 13.548 10.6768 12.65 10.6776V8.44716C13.0617 8.43378 13.4216 8.6033 13.6459 8.89103L13.7241 9.00367C13.8814 9.24974 14.1313 9.42683 14.4208 9.49748C14.7104 9.56814 15.0169 9.52681 15.2756 9.38226C15.5343 9.2377 15.7249 9.00124 15.807 8.72288C15.8892 8.44451 15.8565 8.14607 15.7159 7.89066C15.4225 7.39678 15.0039 6.98377 14.4997 6.69081C13.9956 6.39785 13.4226 6.23465 12.8351 6.21669H12.65C12.65 5.92091 12.5288 5.63725 12.3132 5.4281C12.0975 5.21895 11.805 5.10145 11.5 5.10145ZM12.65 12.9081C12.955 12.9081 13.2475 13.0256 13.4632 13.2348C13.6788 13.4439 13.8 13.7276 13.8 14.0233C13.8 14.3191 13.6788 14.6028 13.4632 14.8119C13.2475 15.0211 12.955 15.1386 12.65 15.1386V12.9081ZM10.35 8.44716V10.6776C10.045 10.6776 9.75249 10.5601 9.53683 10.351C9.32116 10.1418 9.2 9.85818 9.2 9.5624C9.2 9.26662 9.32116 8.98296 9.53683 8.77381C9.75249 8.56466 10.045 8.44716 10.35 8.44716Z"
              fill="#FCD34D"
            />
          </svg>
          <span>10</span>
        </div>
      </div>
      <button
        v-if="task.progress < 100"
        @click="$emit('claim')"
        class="task-btn"
      >
        領取
      </button>
      <button v-else disabled class="claimed-btn task-btn">已領取</button>
    </div>

    <!-- 獎勵徽章（進度達到 100 顯示） -->
    <!-- <div v-if="task.progress === 100" class="badge-container">
      <img :src="badge" alt="徽章" />
    </div> -->
  </div>
</template>

<script>
export default {
  props: {
    task: Object, // { progress: 50, title: "捷運站 1" }
    badge: String, // "捷運徽章 1.png"
  },
};
</script>

<style lang="scss" scoped>
@import "@/assets/sass/base/_color.scss";
@import "@/assets/sass/base/_font.scss";
@import "@/assets/sass/component/_btn.scss";
@import "@/assets/sass/mixin/_mixin.scss";

.task-with-reward {
  // border: 1px solid #ddd;
  padding: 10px;
  margin-bottom: 10px;
  border-radius: 20px;
  background-color: $neutral-150;
}
.reward-title {
  width: 100px;
  height: 100px;
  border-radius: 50%;
  background-color: $metro-red;
  text-align: center;
  font-weight: bold;
  color: $neutral-0;
  padding: 10px 20px;
}
.task-title {
  font-size: 12px;
  font-weight: bold;
}

.progress-container {
  display: flex;
  justify-content: space-between;
  align-items: center;
  gap: 10px;
}
.progress-bar {
  flex: 1;
}

progress {
  width: 100%;
  // width: 80%;
  height: 27.374px;
  overflow: hidden;
  background-color: #e0e0e000;
}

progress::-webkit-progress-bar {
  background-color: $neutral-150;
  border-radius: 11px;
  border: 1px solid $neutral-700;
}
/* 進度條內部填充 */
progress::-webkit-progress-value {
  background-color: $primary-400; // 這是你的 SCSS 變數，改成你要的顏色
  border-radius: 11px;
}
/* Firefox 樣式 */
progress::-moz-progress-bar {
  background-color: $primary-400;
  border-radius: 11px;
}
button {
  @include btn($aqua-400, $neutral-0, 8px);
  border: none;
  min-width: 74px;
  padding: 5px 10px;
}
.progress-icon {
  display: flex;
  align-items: center;
  gap: 5px;
}

button:disabled {
  background-color: #aaa;
  cursor: not-allowed;
}

.badge-container {
  text-align: center;
  margin-top: 10px;
}

.badge-container img {
  width: 50px;
  height: 50px;
}
</style>
