<script setup>
import { ref } from "vue";
import alert_web_M from "../components/alert_web_M.vue";

// 按鈕 所執行的功能

const function_1 = () => {
  console.log("執行功能");
};

const CameraOpenAlertInfo = {
  fristTitle: "允許取用攝影機",
  svg_icon: `
      <svg xmlns="http://www.w3.org/2000/svg" width="196" height="196" viewBox="0 0 196 196" fill="none">
  <path d="M148.531 62.7812H125.562V53.5938H68.1406V62.7812H45.1719C41.923 62.7812 38.8071 64.0719 36.5098 66.3692C34.2125 68.6665 32.9219 71.7823 32.9219 75.0312V138.578C32.9219 141.827 34.2125 144.943 36.5098 147.24C38.8071 149.537 41.923 150.828 45.1719 150.828H148.531C151.78 150.828 154.896 149.537 157.193 147.24C159.491 144.943 160.781 141.827 160.781 138.578V75.0312C160.781 71.7823 159.491 68.6665 157.193 66.3692C154.896 64.0719 151.78 62.7812 148.531 62.7812ZM96.8485 143.938C76.3787 143.938 59.731 127.277 59.731 106.808C59.731 86.338 76.3787 69.678 96.8485 69.678C117.318 69.678 133.978 86.338 133.978 106.808C133.978 127.277 117.318 143.925 96.8485 143.925V143.938ZM96.8485 81.9219C93.58 81.9223 90.3437 82.5664 87.3242 83.8176C84.3046 85.0688 81.5611 86.9024 79.2503 89.2138C76.9394 91.5253 75.1064 94.2692 73.856 97.2891C72.6056 100.309 71.9622 103.545 71.9626 106.814C71.963 110.082 72.6072 113.319 73.8584 116.338C75.1095 119.358 76.9432 122.101 79.2546 124.412C81.566 126.723 84.31 128.556 87.3298 129.806C90.3496 131.057 93.5862 131.7 96.8546 131.7C103.456 131.699 109.787 129.076 114.455 124.407C119.123 119.738 121.744 113.406 121.744 106.805C121.743 100.203 119.119 93.8719 114.451 89.2043C109.782 84.5367 103.45 81.9149 96.8485 81.9157V81.9219Z" fill="#7D8A93"/>
</svg>
        `, //無法確認 ICON 是否可以用外部引入.vue檔方式，目前先使用字串方式
  SecondTittle: "您的裝置需允許使用攝影機",
  ThirdTittle: `需開啟攝影機權限，才能使用攝影機拍照上傳<br><span style:font-weight: thick,font-size: 10px>請輕觸網址列右側的「設定」圖示，開啟「攝影機」</span>`,
  ButtonText: "OK !",
  allowOutsideClick: true,
  function: function_1,
};

const alert_web_M_content = ref(null);
const CameraOpenShowAlert = () => {
  alert_web_M_content.value.showAlert();
};

defineExpose({
  // 暴露 PhotoOpenShowAlert 方法給父組件使用
  CameraOpenShowAlert,
});
</script>

<template>
  <alert_web_M ref="alert_web_M_content" :alertInfo="CameraOpenAlertInfo" />
</template>
